{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 47,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "import sys\n",
    "sys.path.append(sys.path[0][:sys.path[0].find('DVML-P7') + len('DVML-P7')])\n",
    "from Code.UtilityFunctions.run_query import run_query\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "from Code.UtilityFunctions.wikidata_functions import wikidata_query\n",
    "from Code.UtilityFunctions.get_data_path import get_path\n",
    "import pandas as pd"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [],
   "source": [
    "def dbpedia_query(sparql_query: str):\n",
    "    \"\"\"\n",
    "    It takes a SPARQL query as a string, and returns a pandas dataframe of the results\n",
    "    \n",
    "    :param sparql_query: the query you want to run\n",
    "    :type sparql_query: str\n",
    "    :return: The query returns the wikidata item id, the wikidata item label, the wikidata item\n",
    "    description, and the wikidata item category.\n",
    "    \"\"\"\n",
    "    user_agent = \"Yelp knowledge graph mapping/%s.%s\" % (sys.version_info[0], sys.version_info[1])\n",
    "    sparql = SPARQLWrapper(\"https://dbpedia.org/sparql\", agent=user_agent)\n",
    "    sparql.setQuery(sparql_query)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    results = sparql.query().convert()\n",
    "    results_df = pd.json_normalize(results['results']['bindings'])\n",
    "    return results_df"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {
    "collapsed": false
   },
   "source": [
    "### How many people live in the city of top ten most prevelent cities in Yelp?"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Wikidata"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [],
   "source": [
    "biz = pd.read_json(get_path(\"yelp_academic_dataset_business.json\"), lines=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "city           state\n",
       "Philadelphia   PA       14567\n",
       "Tucson         AZ        9249\n",
       "Tampa          FL        9048\n",
       "Indianapolis   IN        7540\n",
       "Nashville      TN        6968\n",
       "New Orleans    LA        6208\n",
       "Reno           NV        5932\n",
       "Edmonton       AB        5054\n",
       "Saint Louis    MO        4827\n",
       "Santa Barbara  CA        3829\n",
       "dtype: int64"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "biz[['city', 'state']].value_counts().head(10)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [],
   "source": [
    "wikidata_city_dict = {\n",
    "    'Philadelphia': 'Q1345',\n",
    "    'Tucson': 'Q18575',\n",
    "    'Tampa': 'Q49255',\n",
    "    'Indianapolis': 'Q6346',\n",
    "    'Nashville': 'Q23197',\n",
    "    'New Orleans': 'Q34404',\n",
    "    'Reno': 'Q49225',\n",
    "    'Edmonton': 'Q2096',\n",
    "    'Saint Louis': 'Q38022',\n",
    "    'Santa Barbara': 'Q159288'\n",
    "    }"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {
    "collapsed": false,
    "pycharm": {
     "name": "#%%\n"
    }
   },
   "outputs": [],
   "source": [
    "list_of_cities = \"wd:Q1345 wd:Q18575 wd:Q49255 wd:Q6346 wd:Q23197 wd:Q34404 wd:Q49225 wd:Q2096 wd:Q38022 wd:Q159288\"\n",
    "sparql_query = f\"\"\"\n",
    "SELECT ?city ?population ?cityLabel \n",
    "WHERE {{\n",
    "  ?city p:P1082 ?statement .\n",
    "  ?statement ps:P1082 ?population .\n",
    "  ?statement pq:P585 ?date .\n",
    "  FILTER NOT EXISTS {{\n",
    "    ?city p:P1082/pq:P585 ?date2 .\n",
    "    FILTER(?date2 > ?date)\n",
    "  }}\n",
    "  VALUES ?city {{{list_of_cities}}} .\n",
    "  SERVICE wikibase:label {{ bd:serviceParam wikibase:language \"en\" . }}\n",
    "}}\n",
    "\"\"\"\n",
    "\n",
    "wikidata_pop = wikidata_query(sparql_query=sparql_query)"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### DBpedia"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [],
   "source": [
    "dbpedia_city_dict = {\n",
    "    'Philidelphia': '\"Philadelphia\"',\n",
    "    'Tucson': '\"Tucson, Arizona\"',\n",
    "    'Tampa': '\"Tampa, Florida\"',\n",
    "    'Indianapolis': '\"Indianapolis\"',\n",
    "    'Nashville': '\"Nashville, Tennessee\"',\n",
    "    'New Orleans': '\"New Orleans\"',\n",
    "    'Reno': '\"Reno, Nevada\"',\n",
    "    'Edmonton': '\"Edmonton\"',\n",
    "    'Saint Louis': '\"St. Louis\"',\n",
    "    'Santa Barbara': '\"Santa Barbara, California\"@en'}"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'\"Philadelphia\"@en \"Tucson, Arizona\"@en \"Tampa, Florida\"@en \"Indianapolis\"@en \"Nashville, Tennessee\"@en \"New Orleans\"@en \"Reno, Nevada\"@en \"Edmonton\"@en \"St. Louis\"@en \"Santa Barbara, California\"@en'"
      ]
     },
     "execution_count": 26,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "\"@en \".join([i for i in dbpedia_city_dict.values()])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [],
   "source": [
    "# list_of_cities = '\"Philadelphia\"@en \"Tucson, Arizona\"@en \"Tampa\"@en \"Indianapolis\"@en \"Nashville\"@en \"New Orleans\"@en \"Reno\"@en \"Edmonton\"@en \"Saint Louis\"@en \"Santa Barbara\"@en'\n",
    "list_of_cities = \"@en \".join([i for i in dbpedia_city_dict.values()])\n",
    "query = f\"\"\"\n",
    "SELECT DISTINCT ?city ?population ?cityname\n",
    "WHERE {{\n",
    "    ?city a dbo:City .\n",
    "    ?city dbo:populationTotal ?population .\n",
    "    ?city rdfs:label ?cityname .\n",
    "    VALUES ?cityname{{{list_of_cities}}}\n",
    "}}\n",
    "\"\"\"\n",
    "dbpedia_pop = dbpedia_query(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'\"Philadelphia\"@en \"Tucson, Arizona\"@en \"Tampa, Florida\"@en \"Indianapolis\"@en \"Nashville, Tennessee\"@en \"New Orleans\"@en \"Reno, Nevada\"@en \"Edmonton\"@en \"St. Louis\"@en \"Santa Barbara, California\"@en'"
      ]
     },
     "execution_count": 28,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "list_of_cities"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### compare WikiData and DBpedia"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>city.value</th>\n",
       "      <th>cityLabel.value</th>\n",
       "      <th>population.value</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://www.wikidata.org/entity/Q6346</td>\n",
       "      <td>Indianapolis</td>\n",
       "      <td>887642</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.wikidata.org/entity/Q159288</td>\n",
       "      <td>Santa Barbara</td>\n",
       "      <td>88665</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>http://www.wikidata.org/entity/Q23197</td>\n",
       "      <td>Nashville</td>\n",
       "      <td>684410</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>http://www.wikidata.org/entity/Q18575</td>\n",
       "      <td>Tucson</td>\n",
       "      <td>542629</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>http://www.wikidata.org/entity/Q49255</td>\n",
       "      <td>Tampa</td>\n",
       "      <td>384959</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>http://www.wikidata.org/entity/Q34404</td>\n",
       "      <td>New Orleans</td>\n",
       "      <td>383997</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>http://www.wikidata.org/entity/Q38022</td>\n",
       "      <td>St. Louis</td>\n",
       "      <td>301578</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>http://www.wikidata.org/entity/Q49225</td>\n",
       "      <td>Reno</td>\n",
       "      <td>264165</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://www.wikidata.org/entity/Q1345</td>\n",
       "      <td>Philadelphia</td>\n",
       "      <td>1603797</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://www.wikidata.org/entity/Q2096</td>\n",
       "      <td>Edmonton</td>\n",
       "      <td>1010899</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                               city.value cityLabel.value population.value\n",
       "3    http://www.wikidata.org/entity/Q6346    Indianapolis           887642\n",
       "0  http://www.wikidata.org/entity/Q159288   Santa Barbara            88665\n",
       "5   http://www.wikidata.org/entity/Q23197       Nashville           684410\n",
       "4   http://www.wikidata.org/entity/Q18575          Tucson           542629\n",
       "9   http://www.wikidata.org/entity/Q49255           Tampa           384959\n",
       "6   http://www.wikidata.org/entity/Q34404     New Orleans           383997\n",
       "7   http://www.wikidata.org/entity/Q38022       St. Louis           301578\n",
       "8   http://www.wikidata.org/entity/Q49225            Reno           264165\n",
       "1    http://www.wikidata.org/entity/Q1345    Philadelphia          1603797\n",
       "2    http://www.wikidata.org/entity/Q2096        Edmonton          1010899"
      ]
     },
     "execution_count": 29,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "wikidata_pop[['city.value','cityLabel.value', 'population.value']].sort_values(by='population.value', ascending=False)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>city.value</th>\n",
       "      <th>cityname.value</th>\n",
       "      <th>population.value</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>http://dbpedia.org/resource/Indianapolis</td>\n",
       "      <td>Indianapolis</td>\n",
       "      <td>887642</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://dbpedia.org/resource/Santa_Barbara,_Cal...</td>\n",
       "      <td>Santa Barbara, California</td>\n",
       "      <td>88665</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://dbpedia.org/resource/Nashville,_Tennessee</td>\n",
       "      <td>Nashville, Tennessee</td>\n",
       "      <td>715884</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>http://dbpedia.org/resource/Tucson,_Arizona</td>\n",
       "      <td>Tucson, Arizona</td>\n",
       "      <td>542629</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://dbpedia.org/resource/Tampa,_Florida</td>\n",
       "      <td>Tampa, Florida</td>\n",
       "      <td>384959</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>http://dbpedia.org/resource/New_Orleans</td>\n",
       "      <td>New Orleans</td>\n",
       "      <td>383997</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>http://dbpedia.org/resource/St._Louis</td>\n",
       "      <td>St. Louis</td>\n",
       "      <td>301578</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://dbpedia.org/resource/Reno,_Nevada</td>\n",
       "      <td>Reno, Nevada</td>\n",
       "      <td>264165</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>http://dbpedia.org/resource/Philadelphia</td>\n",
       "      <td>Philadelphia</td>\n",
       "      <td>1603797</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>http://dbpedia.org/resource/Edmonton</td>\n",
       "      <td>Edmonton</td>\n",
       "      <td>1010899</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                          city.value  \\\n",
       "9           http://dbpedia.org/resource/Indianapolis   \n",
       "0  http://dbpedia.org/resource/Santa_Barbara,_Cal...   \n",
       "3   http://dbpedia.org/resource/Nashville,_Tennessee   \n",
       "4        http://dbpedia.org/resource/Tucson,_Arizona   \n",
       "1         http://dbpedia.org/resource/Tampa,_Florida   \n",
       "5            http://dbpedia.org/resource/New_Orleans   \n",
       "8              http://dbpedia.org/resource/St._Louis   \n",
       "2           http://dbpedia.org/resource/Reno,_Nevada   \n",
       "6           http://dbpedia.org/resource/Philadelphia   \n",
       "7               http://dbpedia.org/resource/Edmonton   \n",
       "\n",
       "              cityname.value population.value  \n",
       "9               Indianapolis           887642  \n",
       "0  Santa Barbara, California            88665  \n",
       "3       Nashville, Tennessee           715884  \n",
       "4            Tucson, Arizona           542629  \n",
       "1             Tampa, Florida           384959  \n",
       "5                New Orleans           383997  \n",
       "8                  St. Louis           301578  \n",
       "2               Reno, Nevada           264165  \n",
       "6               Philadelphia          1603797  \n",
       "7                   Edmonton          1010899  "
      ]
     },
     "execution_count": 30,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "dbpedia_pop[['city.value','cityname.value', 'population.value']].sort_values(by='population.value', ascending=False)"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## CQ 2: How many of 10 random cities from the yelp dataset are in both Wikidata and DBpedia?\n",
    "### How many of these cities have a population?"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Wikidata"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>city</th>\n",
       "      <th>state</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>90691</th>\n",
       "      <td>Edgemont</td>\n",
       "      <td>PA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>699</th>\n",
       "      <td>Safety Harbor</td>\n",
       "      <td>FL</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>95702</th>\n",
       "      <td>Folsom</td>\n",
       "      <td>NJ</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>136</th>\n",
       "      <td>Land O Lakes</td>\n",
       "      <td>FL</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>955</th>\n",
       "      <td>Fort Washington</td>\n",
       "      <td>PA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6538</th>\n",
       "      <td>Avondale</td>\n",
       "      <td>LA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4226</th>\n",
       "      <td>Willingboro</td>\n",
       "      <td>NJ</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1145</th>\n",
       "      <td>Glen Carbon</td>\n",
       "      <td>IL</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>943</th>\n",
       "      <td>Mount Laurel</td>\n",
       "      <td>NJ</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>90</th>\n",
       "      <td>Plainfield</td>\n",
       "      <td>IN</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                  city state\n",
       "90691         Edgemont    PA\n",
       "699      Safety Harbor    FL\n",
       "95702           Folsom    NJ\n",
       "136       Land O Lakes    FL\n",
       "955    Fort Washington    PA\n",
       "6538          Avondale    LA\n",
       "4226       Willingboro    NJ\n",
       "1145       Glen Carbon    IL\n",
       "943       Mount Laurel    NJ\n",
       "90          Plainfield    IN"
      ]
     },
     "execution_count": 31,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "city_sample = biz[['city','state']].drop_duplicates().sample(10, random_state=42)\n",
    "city_sample"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "metadata": {},
   "outputs": [],
   "source": [
    "sample_dict = city_sample.set_index('city')['state'].to_dict()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'Edgemont': 'Pennsylvania',\n",
       " 'Safety Harbor': 'Florida',\n",
       " 'Folsom': 'New Jersey',\n",
       " 'Fort Washington': 'Pennsylvania',\n",
       " 'Avondale': 'Louisiana',\n",
       " 'Willingboro': 'New Jersey',\n",
       " 'Glen Carbon': 'Illinois',\n",
       " 'Mount Laurel': 'New Jersey',\n",
       " 'Plainfield': 'Indiana',\n",
       " \"Land O' Lakes\": 'Florida'}"
      ]
     },
     "execution_count": 33,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "state_update = {'PA': 'Pennsylvania',\n",
    "'FL': 'Florida',\n",
    "'NJ': 'New Jersey',\n",
    "'LA': 'Louisiana',\n",
    "'IL': 'Illinois',\n",
    "'IN': 'Indiana'}\n",
    "\n",
    "sample_dict_updated = {}\n",
    "# Iterate through the key-value pairs in the first dictionary\n",
    "for key, value in sample_dict.items():\n",
    "    # Update the value in the first dictionary with the value from the second dictionary\n",
    "    sample_dict_updated[key] = state_update[value]\n",
    "sample_dict_updated[\"Land O' Lakes\"] = sample_dict_updated.pop('Land O Lakes')\n",
    "\n",
    "sample_dict_updated"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>city.value</th>\n",
       "      <th>cityLabel.value</th>\n",
       "      <th>state.value</th>\n",
       "      <th>stateLabel.value</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.wikidata.org/entity/Q5337787</td>\n",
       "      <td>Edgemont</td>\n",
       "      <td>http://www.wikidata.org/entity/Q1400</td>\n",
       "      <td>Pennsylvania</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://www.wikidata.org/entity/Q952992</td>\n",
       "      <td>Safety Harbor</td>\n",
       "      <td>http://www.wikidata.org/entity/Q812</td>\n",
       "      <td>Florida</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://www.wikidata.org/entity/Q1083022</td>\n",
       "      <td>Folsom</td>\n",
       "      <td>http://www.wikidata.org/entity/Q1408</td>\n",
       "      <td>New Jersey</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://www.wikidata.org/entity/Q1133576</td>\n",
       "      <td>Fort Washington</td>\n",
       "      <td>http://www.wikidata.org/entity/Q1400</td>\n",
       "      <td>Pennsylvania</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>http://www.wikidata.org/entity/Q1994608</td>\n",
       "      <td>Avondale</td>\n",
       "      <td>http://www.wikidata.org/entity/Q1588</td>\n",
       "      <td>Louisiana</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>http://www.wikidata.org/entity/Q1072819</td>\n",
       "      <td>Willingboro Township, New Jersey</td>\n",
       "      <td>http://www.wikidata.org/entity/Q1408</td>\n",
       "      <td>New Jersey</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>http://www.wikidata.org/entity/Q1375820</td>\n",
       "      <td>Glen Carbon</td>\n",
       "      <td>http://www.wikidata.org/entity/Q1204</td>\n",
       "      <td>Illinois</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>http://www.wikidata.org/entity/Q1072657</td>\n",
       "      <td>Mount Laurel</td>\n",
       "      <td>http://www.wikidata.org/entity/Q1408</td>\n",
       "      <td>New Jersey</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>http://www.wikidata.org/entity/Q986631</td>\n",
       "      <td>Plainfield</td>\n",
       "      <td>http://www.wikidata.org/entity/Q1415</td>\n",
       "      <td>Indiana</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>http://www.wikidata.org/entity/Q2375799</td>\n",
       "      <td>Land O' Lakes</td>\n",
       "      <td>http://www.wikidata.org/entity/Q812</td>\n",
       "      <td>Florida</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                city.value                   cityLabel.value  \\\n",
       "0  http://www.wikidata.org/entity/Q5337787                          Edgemont   \n",
       "1   http://www.wikidata.org/entity/Q952992                     Safety Harbor   \n",
       "2  http://www.wikidata.org/entity/Q1083022                            Folsom   \n",
       "3  http://www.wikidata.org/entity/Q1133576                   Fort Washington   \n",
       "4  http://www.wikidata.org/entity/Q1994608                          Avondale   \n",
       "5  http://www.wikidata.org/entity/Q1072819  Willingboro Township, New Jersey   \n",
       "6  http://www.wikidata.org/entity/Q1375820                       Glen Carbon   \n",
       "7  http://www.wikidata.org/entity/Q1072657                      Mount Laurel   \n",
       "8   http://www.wikidata.org/entity/Q986631                        Plainfield   \n",
       "9  http://www.wikidata.org/entity/Q2375799                     Land O' Lakes   \n",
       "\n",
       "                            state.value stateLabel.value  \n",
       "0  http://www.wikidata.org/entity/Q1400     Pennsylvania  \n",
       "1   http://www.wikidata.org/entity/Q812          Florida  \n",
       "2  http://www.wikidata.org/entity/Q1408       New Jersey  \n",
       "3  http://www.wikidata.org/entity/Q1400     Pennsylvania  \n",
       "4  http://www.wikidata.org/entity/Q1588        Louisiana  \n",
       "5  http://www.wikidata.org/entity/Q1408       New Jersey  \n",
       "6  http://www.wikidata.org/entity/Q1204         Illinois  \n",
       "7  http://www.wikidata.org/entity/Q1408       New Jersey  \n",
       "8  http://www.wikidata.org/entity/Q1415          Indiana  \n",
       "9   http://www.wikidata.org/entity/Q812          Florida  "
      ]
     },
     "execution_count": 34,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df = pd.DataFrame()\n",
    "for key, value in sample_dict_updated.items():\n",
    "    sparql_query = f\"\"\"\n",
    "    SELECT DISTINCT ?city ?cityLabel ?state ?stateLabel\n",
    "    WHERE{{\n",
    "    FILTER(STRSTARTS(?cityLabel, \"{key}\"@en)).\n",
    "    VALUES ?stateLabel {{\"{value}\"@en}}\n",
    "    ?city rdfs:label ?cityLabel.\n",
    "    ?city wdt:P131/wdt:P131 | wdt:P131 ?state .\n",
    "    ?city wdt:P31/wdt:P279* wd:Q486972 .\n",
    "    ?state rdfs:label ?stateLabel .\n",
    "    SERVICE wikibase:label {{ bd:serviceParam wikibase:language \"en\". }} \n",
    "    }}\n",
    "    LIMIT 1\n",
    "    \"\"\"\n",
    "    df2 = wikidata_query(sparql_query=sparql_query)\n",
    "    df = pd.concat([df, df2], ignore_index=True)\n",
    "df[['city.value', 'cityLabel.value', 'state.value', 'stateLabel.value']]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'wd:Q5337787 wd:Q952992 wd:Q1083022 wd:Q1133576 wd:Q1994608 wd:Q1072819 wd:Q1375820 wd:Q1072657 wd:Q986631 wd:Q2375799'"
      ]
     },
     "execution_count": 35,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "list_city_qid = \" \".join(df['city.value'].apply(lambda x: 'wd:' + x.split('/')[-1]).to_list())\n",
    "list_city_qid"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>city.value</th>\n",
       "      <th>cityLabel.value</th>\n",
       "      <th>population.value</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.wikidata.org/entity/Q952992</td>\n",
       "      <td>Safety Harbor</td>\n",
       "      <td>17072</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://www.wikidata.org/entity/Q986631</td>\n",
       "      <td>Plainfield</td>\n",
       "      <td>34625</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://www.wikidata.org/entity/Q1072657</td>\n",
       "      <td>Mount Laurel</td>\n",
       "      <td>44633</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://www.wikidata.org/entity/Q1072819</td>\n",
       "      <td>Willingboro Township</td>\n",
       "      <td>31889</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>http://www.wikidata.org/entity/Q1083022</td>\n",
       "      <td>Folsom</td>\n",
       "      <td>1811</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>http://www.wikidata.org/entity/Q1133576</td>\n",
       "      <td>Fort Washington</td>\n",
       "      <td>5910</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>http://www.wikidata.org/entity/Q1375820</td>\n",
       "      <td>Glen Carbon</td>\n",
       "      <td>13842</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>http://www.wikidata.org/entity/Q1994608</td>\n",
       "      <td>Avondale</td>\n",
       "      <td>4582</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>http://www.wikidata.org/entity/Q2375799</td>\n",
       "      <td>Land O' Lakes</td>\n",
       "      <td>35929</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                city.value       cityLabel.value  \\\n",
       "0   http://www.wikidata.org/entity/Q952992         Safety Harbor   \n",
       "1   http://www.wikidata.org/entity/Q986631            Plainfield   \n",
       "2  http://www.wikidata.org/entity/Q1072657          Mount Laurel   \n",
       "3  http://www.wikidata.org/entity/Q1072819  Willingboro Township   \n",
       "4  http://www.wikidata.org/entity/Q1083022                Folsom   \n",
       "5  http://www.wikidata.org/entity/Q1133576       Fort Washington   \n",
       "6  http://www.wikidata.org/entity/Q1375820           Glen Carbon   \n",
       "7  http://www.wikidata.org/entity/Q1994608              Avondale   \n",
       "8  http://www.wikidata.org/entity/Q2375799         Land O' Lakes   \n",
       "\n",
       "  population.value  \n",
       "0            17072  \n",
       "1            34625  \n",
       "2            44633  \n",
       "3            31889  \n",
       "4             1811  \n",
       "5             5910  \n",
       "6            13842  \n",
       "7             4582  \n",
       "8            35929  "
      ]
     },
     "execution_count": 36,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "sparql_query = f\"\"\"\n",
    "SELECT ?city ?population ?cityLabel \n",
    "WHERE {{\n",
    "  ?city p:P1082 ?statement .\n",
    "  ?statement ps:P1082 ?population .\n",
    "  ?statement pq:P585 ?date .\n",
    "  FILTER NOT EXISTS {{\n",
    "    ?city p:P1082/pq:P585 ?date2 .\n",
    "    FILTER(?date2 > ?date)\n",
    "  }}\n",
    "  VALUES ?city {{{list_city_qid}}} .\n",
    "  SERVICE wikibase:label {{ bd:serviceParam wikibase:language \"en\" . }}\n",
    "}}\n",
    "\"\"\"\n",
    "\n",
    "wikidata_query(sparql_query=sparql_query)[['city.value','cityLabel.value', 'population.value']]"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## DBPedia"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 37,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "\n",
    "df = pd.DataFrame()\n",
    "for key, value in sample_dict_updated.items():\n",
    "    sparql_query = f\"\"\"\n",
    "    SELECT ?val ?city ?cityName ?county ?state ?stateName\n",
    "    WHERE {{\n",
    "    VALUES ?val {{\"{key}\"}}\n",
    "    VALUES ?val2 {{\"{value}\"}}\n",
    "    ?city a dbo:City ;\n",
    "            dbp:name ?cityName  .\n",
    "            ?county dbo:county ?city .\n",
    "    ?county dbo:state ?state .\n",
    "    ?state dbp:name ?stateName .\n",
    "    FILTER(contains(str(?cityName), ?val) && contains(str(?stateName), ?val2)).\n",
    "    }}\n",
    "\n",
    "    \"\"\"\n",
    "    df2 = dbpedia_query(sparql_query=sparql_query)\n",
    "    df = pd.concat([df, df2], ignore_index=True)\n",
    "df"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## CQ 3: How many cities are in the 10 most prevelent states/provinces in Yelp?"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Wikidata"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "PA    34039\n",
       "FL    26330\n",
       "TN    12056\n",
       "IN    11247\n",
       "MO    10913\n",
       "LA     9924\n",
       "AZ     9912\n",
       "NJ     8536\n",
       "NV     7715\n",
       "AB     5573\n",
       "Name: state, dtype: int64"
      ]
     },
     "execution_count": 38,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "yelp_state = biz['state'].value_counts().head(10)\n",
    "yelp_state"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "metadata": {},
   "outputs": [],
   "source": [
    "wd_state_dict = {\n",
    "'PA': 'wd:Q1400',\n",
    "'FL': 'wd:Q812',\n",
    "'TN': 'wd:Q1509',\n",
    "'IN': 'wd:Q1415',\n",
    "'MO': 'wd:Q1581',\n",
    "'LA': 'wd:Q1588',\n",
    "'AZ': 'wd:Q816',\n",
    "'NJ': 'wd:Q1408',\n",
    "'NV': 'wd:Q1227',\n",
    "'AB': 'wd:Q1951',\n",
    "}"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>stateLabel.value</th>\n",
       "      <th>numCities.value</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Alberta</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Florida</td>\n",
       "      <td>387</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Nevada</td>\n",
       "      <td>20</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Tennessee</td>\n",
       "      <td>324</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Missouri</td>\n",
       "      <td>645</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Indiana</td>\n",
       "      <td>491</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Arizona</td>\n",
       "      <td>88</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Louisiana</td>\n",
       "      <td>111</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>New Jersey</td>\n",
       "      <td>92</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Pennsylvania</td>\n",
       "      <td>58</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  stateLabel.value numCities.value\n",
       "0          Alberta               4\n",
       "1          Florida             387\n",
       "2           Nevada              20\n",
       "3        Tennessee             324\n",
       "4         Missouri             645\n",
       "5          Indiana             491\n",
       "6          Arizona              88\n",
       "7        Louisiana             111\n",
       "8       New Jersey              92\n",
       "9     Pennsylvania              58"
      ]
     },
     "execution_count": 40,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "wd_state_list = \" \".join([v for v in wd_state_dict.values()])\n",
    "sparql_query = f\"\"\"\n",
    "SELECT DISTINCT ?stateLabel ?numCities\n",
    "WHERE {{\n",
    "VALUES ?state {{{wd_state_list}}}\n",
    "{{?state wdt:P31 wd:Q35657 .}}\n",
    "UNION\n",
    "{{?state wdt:P31 wd:Q11828004 .}}\n",
    "\n",
    "{{ SELECT ?state (COUNT(DISTINCT ?city) as ?numCities)\n",
    "WHERE\n",
    "{{\n",
    "    {{?city wdt:P31/wdt:P279* wd:Q1093829.}}\n",
    "    UNION\n",
    "    {{?city wdt:P31/wdt:P279* wd:Q515.}}\n",
    "    UNION\n",
    "    {{?city wdt:P31/wdt:P279* wd:Q15127012.}}\n",
    "    ?city wdt:P131/wdt:P131 ?state .\n",
    "}}\n",
    "GROUP BY ?state\n",
    "}}\n",
    "SERVICE wikibase:label {{ bd:serviceParam wikibase:language \"en\". }}\n",
    "}}\n",
    "\"\"\"\n",
    "\n",
    "wikidata_query(sparql_query=sparql_query)[['stateLabel.value', 'numCities.value']]"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### DBpedia"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>count.value</th>\n",
       "      <th>var.value</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>57</td>\n",
       "      <td>Cities in Pennsylvania</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>267</td>\n",
       "      <td>Cities in Florida</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>19</td>\n",
       "      <td>Cities in Alberta</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>118</td>\n",
       "      <td>Cities in Indiana</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>20</td>\n",
       "      <td>Cities in Nevada</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>181</td>\n",
       "      <td>Cities in Tennessee</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>671</td>\n",
       "      <td>Cities in Missouri</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>70</td>\n",
       "      <td>Cities in Louisiana</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>47</td>\n",
       "      <td>Cities in Arizona</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  count.value               var.value\n",
       "0          57  Cities in Pennsylvania\n",
       "1         267       Cities in Florida\n",
       "2          19       Cities in Alberta\n",
       "3         118       Cities in Indiana\n",
       "4          20        Cities in Nevada\n",
       "5         181     Cities in Tennessee\n",
       "6         671      Cities in Missouri\n",
       "7          70     Cities in Louisiana\n",
       "8          47       Cities in Arizona"
      ]
     },
     "execution_count": 41,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Cities of list entities in DBpedia from https://dbpedia.org/page/Template:Cities_in_the_United_States\n",
    "sparql_query = \"\"\"\n",
    "SELECT (COUNT(DISTINCT ?city) AS ?count) ?var\n",
    "WHERE {\n",
    "    ?city a dbo:City .\n",
    "    ?city dct:subject ?location .\n",
    "    ?location rdfs:label ?var\n",
    "    VALUES ?var {\n",
    "\"Cities in Florida\"@en  \n",
    "\"Cities in Nevada\"@en\n",
    "\"Cities in Tennessee\"@en\n",
    "\"Cities in Missouri\"@en\n",
    "\"Cities in Indiana\"@en\n",
    "\"Cities in Arizona\"@en\n",
    "\"Cities in Louisiana\"@en\n",
    "\"Cities in New Jersey\"@en\n",
    "\"Cities in Pennsylvania\"@en\n",
    "\"Cities in Alberta\"@en\n",
    "}\n",
    "}\n",
    "\"\"\"\n",
    "dbpedia_query(sparql_query=sparql_query)[['count.value', 'var.value']]"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## CQ 4: What drinks exist that are beverages?\n",
    "## TODO: check more categories"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 49,
   "metadata": {},
   "outputs": [],
   "source": [
    "category_occurences = pd.read_csv(get_path('category_occurences.csv'))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 53,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>category</th>\n",
       "      <th>occurences</th>\n",
       "      <th>split_category</th>\n",
       "      <th>SchemaType</th>\n",
       "      <th>schema_or_yelp_category</th>\n",
       "      <th>qid</th>\n",
       "      <th>qid_label</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>52268</td>\n",
       "      <td>Restaurant</td>\n",
       "      <td>Restaurant</td>\n",
       "      <td>Restaurant</td>\n",
       "      <td>Q11707</td>\n",
       "      <td>restaurant</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Food</td>\n",
       "      <td>27781</td>\n",
       "      <td>Food</td>\n",
       "      <td>NaN</td>\n",
       "      <td>Food</td>\n",
       "      <td>Q2095</td>\n",
       "      <td>food</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Shopping</td>\n",
       "      <td>24395</td>\n",
       "      <td>Shopping</td>\n",
       "      <td>Retail</td>\n",
       "      <td>Retail</td>\n",
       "      <td>Q126793</td>\n",
       "      <td>retail</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Home Services</td>\n",
       "      <td>14356</td>\n",
       "      <td>HomeService</td>\n",
       "      <td>Service</td>\n",
       "      <td>Service</td>\n",
       "      <td>Q44127</td>\n",
       "      <td>server</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Beauty &amp; Spas</td>\n",
       "      <td>14292</td>\n",
       "      <td>Beauty</td>\n",
       "      <td>DaySpa</td>\n",
       "      <td>DaySpa</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Beauty &amp; Spas</td>\n",
       "      <td>14292</td>\n",
       "      <td>Spa</td>\n",
       "      <td>DaySpa</td>\n",
       "      <td>DaySpa</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Nightlife</td>\n",
       "      <td>12281</td>\n",
       "      <td>Nightlife</td>\n",
       "      <td>NightClub</td>\n",
       "      <td>NightClub</td>\n",
       "      <td>Q622425</td>\n",
       "      <td>nightclub</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Health &amp; Medical</td>\n",
       "      <td>11890</td>\n",
       "      <td>Health</td>\n",
       "      <td>Physician</td>\n",
       "      <td>Physician</td>\n",
       "      <td>Q33749</td>\n",
       "      <td>Ivan Alev</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Health &amp; Medical</td>\n",
       "      <td>11890</td>\n",
       "      <td>Medical</td>\n",
       "      <td>Physician</td>\n",
       "      <td>Physician</td>\n",
       "      <td>Q33749</td>\n",
       "      <td>Ivan Alev</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Local Services</td>\n",
       "      <td>11198</td>\n",
       "      <td>LocalService</td>\n",
       "      <td>LocalBusiness</td>\n",
       "      <td>LocalBusiness</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>Bars</td>\n",
       "      <td>11065</td>\n",
       "      <td>Bar</td>\n",
       "      <td>BarOrPub</td>\n",
       "      <td>BarOrPub</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>Automotive</td>\n",
       "      <td>10773</td>\n",
       "      <td>Automotive</td>\n",
       "      <td>AutomotiveBusiness</td>\n",
       "      <td>AutomotiveBusiness</td>\n",
       "      <td>Q4036443</td>\n",
       "      <td>Comil</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>Event Planning &amp; Services</td>\n",
       "      <td>9895</td>\n",
       "      <td>EventPlanning</td>\n",
       "      <td>Event</td>\n",
       "      <td>Event</td>\n",
       "      <td>Q44505</td>\n",
       "      <td>4 April 2010 Baghdad bombings</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>Event Planning &amp; Services</td>\n",
       "      <td>9895</td>\n",
       "      <td>EventService</td>\n",
       "      <td>Event</td>\n",
       "      <td>Event</td>\n",
       "      <td>Q44505</td>\n",
       "      <td>4 April 2010 Baghdad bombings</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>Sandwiches</td>\n",
       "      <td>8366</td>\n",
       "      <td>Sandwich</td>\n",
       "      <td>NaN</td>\n",
       "      <td>Sandwich</td>\n",
       "      <td>Q28803</td>\n",
       "      <td>sandwich</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>American (Traditional)</td>\n",
       "      <td>8139</td>\n",
       "      <td>American(Traditional)</td>\n",
       "      <td>NaN</td>\n",
       "      <td>American(Traditional)</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>Active Life</td>\n",
       "      <td>7687</td>\n",
       "      <td>ActiveLife</td>\n",
       "      <td>NaN</td>\n",
       "      <td>ActiveLife</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>Pizza</td>\n",
       "      <td>7093</td>\n",
       "      <td>Pizza</td>\n",
       "      <td>NaN</td>\n",
       "      <td>Pizza</td>\n",
       "      <td>Q177</td>\n",
       "      <td>pizza</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>Coffee &amp; Tea</td>\n",
       "      <td>6703</td>\n",
       "      <td>Coffee</td>\n",
       "      <td>NaN</td>\n",
       "      <td>Coffee</td>\n",
       "      <td>Q8486</td>\n",
       "      <td>coffee</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>Coffee &amp; Tea</td>\n",
       "      <td>6703</td>\n",
       "      <td>Tea</td>\n",
       "      <td>NaN</td>\n",
       "      <td>Tea</td>\n",
       "      <td>Q6097</td>\n",
       "      <td>tea</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                     category  occurences         split_category  \\\n",
       "0                 Restaurants       52268             Restaurant   \n",
       "1                        Food       27781                   Food   \n",
       "2                    Shopping       24395               Shopping   \n",
       "3               Home Services       14356            HomeService   \n",
       "4               Beauty & Spas       14292                 Beauty   \n",
       "5               Beauty & Spas       14292                    Spa   \n",
       "6                   Nightlife       12281              Nightlife   \n",
       "7            Health & Medical       11890                 Health   \n",
       "8            Health & Medical       11890                Medical   \n",
       "9              Local Services       11198           LocalService   \n",
       "10                       Bars       11065                    Bar   \n",
       "11                 Automotive       10773             Automotive   \n",
       "12  Event Planning & Services        9895          EventPlanning   \n",
       "13  Event Planning & Services        9895           EventService   \n",
       "14                 Sandwiches        8366               Sandwich   \n",
       "15     American (Traditional)        8139  American(Traditional)   \n",
       "16                Active Life        7687             ActiveLife   \n",
       "17                      Pizza        7093                  Pizza   \n",
       "18               Coffee & Tea        6703                 Coffee   \n",
       "19               Coffee & Tea        6703                    Tea   \n",
       "\n",
       "            SchemaType schema_or_yelp_category       qid  \\\n",
       "0           Restaurant              Restaurant    Q11707   \n",
       "1                  NaN                    Food     Q2095   \n",
       "2               Retail                  Retail   Q126793   \n",
       "3              Service                 Service    Q44127   \n",
       "4               DaySpa                  DaySpa       NaN   \n",
       "5               DaySpa                  DaySpa       NaN   \n",
       "6            NightClub               NightClub   Q622425   \n",
       "7            Physician               Physician    Q33749   \n",
       "8            Physician               Physician    Q33749   \n",
       "9        LocalBusiness           LocalBusiness       NaN   \n",
       "10            BarOrPub                BarOrPub       NaN   \n",
       "11  AutomotiveBusiness      AutomotiveBusiness  Q4036443   \n",
       "12               Event                   Event    Q44505   \n",
       "13               Event                   Event    Q44505   \n",
       "14                 NaN                Sandwich    Q28803   \n",
       "15                 NaN   American(Traditional)       NaN   \n",
       "16                 NaN              ActiveLife       NaN   \n",
       "17                 NaN                   Pizza      Q177   \n",
       "18                 NaN                  Coffee     Q8486   \n",
       "19                 NaN                     Tea     Q6097   \n",
       "\n",
       "                        qid_label  \n",
       "0                      restaurant  \n",
       "1                            food  \n",
       "2                          retail  \n",
       "3                          server  \n",
       "4                             NaN  \n",
       "5                             NaN  \n",
       "6                       nightclub  \n",
       "7                       Ivan Alev  \n",
       "8                       Ivan Alev  \n",
       "9                             NaN  \n",
       "10                            NaN  \n",
       "11                          Comil  \n",
       "12  4 April 2010 Baghdad bombings  \n",
       "13  4 April 2010 Baghdad bombings  \n",
       "14                       sandwich  \n",
       "15                            NaN  \n",
       "16                            NaN  \n",
       "17                          pizza  \n",
       "18                         coffee  \n",
       "19                            tea  "
      ]
     },
     "execution_count": 53,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "category_occurences.head(20)"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "- Q40050: Drink\n",
    "- Q177: Pizza\n",
    "- Q11707: Restaurant\n",
    "- Q62849941: LocalBusiness\n",
    "- Q786803: Car dealership"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 59,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>value.value</th>\n",
       "      <th>valueLabel.value</th>\n",
       "      <th>count.value</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.wikidata.org/entity/Q11707</td>\n",
       "      <td>restaurant</td>\n",
       "      <td>234</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://www.wikidata.org/entity/Q177</td>\n",
       "      <td>pizza</td>\n",
       "      <td>60</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://www.wikidata.org/entity/Q40050</td>\n",
       "      <td>drink</td>\n",
       "      <td>6662</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://www.wikidata.org/entity/Q786803</td>\n",
       "      <td>car dealership</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>http://www.wikidata.org/entity/Q4830453</td>\n",
       "      <td>business</td>\n",
       "      <td>3518</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                               value.value valueLabel.value count.value\n",
       "0    http://www.wikidata.org/entity/Q11707       restaurant         234\n",
       "1      http://www.wikidata.org/entity/Q177            pizza          60\n",
       "2    http://www.wikidata.org/entity/Q40050            drink        6662\n",
       "3   http://www.wikidata.org/entity/Q786803   car dealership           1\n",
       "4  http://www.wikidata.org/entity/Q4830453         business        3518"
      ]
     },
     "execution_count": 59,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "sparql_query = \"\"\"\n",
    "SELECT ?value ?valueLabel (COUNT (DISTINCT ?category) AS ?count)\n",
    "    WHERE {\n",
    "        VALUES ?value {wd:Q40050 wd:Q177 wd:Q11707 wd:Q4830453 wd:Q786803}\n",
    "        ?category wdt:P279+ ?value .\n",
    "        SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n",
    "    }\n",
    "    GROUP BY ?value ?valueLabel\n",
    "\"\"\"\n",
    "wikidata_query(sparql_query=sparql_query)[['value.value', 'valueLabel.value', 'count.value']]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 58,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>value.value</th>\n",
       "      <th>count.value</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://dbpedia.org/ontology/Beverage</td>\n",
       "      <td>1884</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://dbpedia.org/ontology/Restaurant</td>\n",
       "      <td>2838</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                              value.value count.value\n",
       "0    http://dbpedia.org/ontology/Beverage        1884\n",
       "1  http://dbpedia.org/ontology/Restaurant        2838"
      ]
     },
     "execution_count": 58,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "sparql_query = \"\"\"\n",
    "SELECT ?value (COUNT (DISTINCT ?category) AS ?count)\n",
    "WHERE {\n",
    "    VALUES ?value {dbo:Beverage dbo:Car_dealership dbo:Business dbo:Restaurant dbo:Pizza}\n",
    "    ?category rdf:type ?value\n",
    "}\n",
    "GROUP BY ?value\n",
    "\"\"\"\n",
    "dbpedia_query(sparql_query=sparql_query)[['value.value', 'count.value']]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.6"
  },
  "vscode": {
   "interpreter": {
    "hash": "7e1998ff7f8aa20ada591c520b972326324e5ea05489af9e422744c7c09f6dad"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 0
}
